In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\goodluck\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\goodluck\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\goodluck\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\goodluck\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\goodluck\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\goodluck\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [12]:
import pandas as pd

# read data from CSV file into a data frame

# CSV = > Comma seprated values file
 # df = pd.read_csv(r"C:\Users\GOODLUCK\Downloads\sales_data_sample.csv", encoding="latin1")# as a string pass krna ha

# excel
 # df = pd.read_excel(r"C:\Users\GOODLUCK\Downloads\sales_data_sample.xlsx")

# json => like dict
df = pd.read_json(r"C:\Users\GOODLUCK\Downloads\sample_Data.json")
print('Display 10 rows of first : ')
print(df.head())

print('\n Display 10 rows of last : ')
print(df.tail(3))

Display 10 rows of first :
   id                                         name  \
0   1                              Apple iPhone 12
1   2                           Samsung Galaxy S21
2   3                           Sony PlayStation 5
3   4            LG OLED55CXPUA 55-inch 4K OLED TV
4   5  Bose QuietComfort 35 II Wireless Headphones

                                         description    price     category  \
0  The Apple iPhone 12 features a 6.1-inch Super ...   999.00  Electronics
1  The Samsung Galaxy S21 features a 6.2-inch Dyn...   799.00  Electronics
2  The Sony PlayStation 5 features an AMD Zen 2-b...   499.99  Electronics
3  The LG OLED55CXPUA 55-inch 4K OLED TV features...  1599.99  Electronics
4  The Bose QuietComfort 35 II Wireless Headphone...   299.00  Electronics

                                               image
0  https://www.apple.com/newsroom/images/product/...
1  https://images.samsung.com/is/image/samsung/p6...
2  https://www.sony.com/image/44baa604124b770c824...
3  https://www.lg.com/us/images/tvs/md07501804/ga...
4  https://assets.bose.com/content/dam/Bose_DAM/W...

 Display 10 rows of last :
    id                              name  \
17  18    iRobot Roomba i7+ Robot Vacuum
18  19  Ninja Foodi Digital Air Fry Oven
19  20  Cuisinart ICE-70 Ice Cream Maker

                                          description   price        category  \
17  The iRobot Roomba i7+ Robot Vacuum features au...  799.99  Home & Kitchen
18  The Ninja Foodi Digital Air Fry Oven features ...  209.99  Home & Kitchen
19  The Cuisinart ICE-70 Ice Cream Maker features ...  139.99  Home & Kitchen

                                                image
17  https://store.irobot.com/default/i7-vacuuming-...
18  https://www.ninjakitchen.com/static/img/produc...
19  https://www.cuisinart.com/share/images/product...

In [13]:
print('Display the info of data set :')
print(df.info())

Display the info of data set :
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           20 non-null     int64
 1   name         20 non-null     object
 2   description  20 non-null     object
 3   price        20 non-null     float64
 4   category     20 non-null     object
 5   image        20 non-null     object
dtypes: float64(1), int64(1), object(4)
memory usage: 1.1+ KB
None

In [15]:
# sample data frame using dictionary
data = {
    "Name " : ["Aqsa" , "Erum" ,"Saba" , "Ayesha " , "Gull"],
    "Age" : [22,23,24,21,20],
    "Salary" : [50000 , 60000 , 30000 , 45000 , 55000],
    "Performance" :[85,90,92,88,89]

}
df =pd.DataFrame(data)
print("Smaple Dataframe")
print(df)
print("Descriptive Statistics")
print(df.describe())

Smaple Dataframe
     Name   Age  Salary  Performance
0     Aqsa   22   50000           85
1     Erum   23   60000           90
2     Saba   24   30000           92
3  Ayesha    21   45000           88
4     Gull   20   55000           89
Descriptive Statistics
             Age        Salary  Performance
count   5.000000      5.000000     5.000000
mean   22.000000  48000.000000    88.800000
std     1.581139  11510.864433     2.588436
min    20.000000  30000.000000    85.000000
25%    21.000000  45000.000000    88.000000
50%    22.000000  50000.000000    89.000000
75%    23.000000  55000.000000    90.000000
max    24.000000  60000.000000    92.000000

In [16]:
print(f"Shape : {df.shape}") # row , column
print(f"Column Names : {df.columns}")

Shape : (5, 4)
Column Names : Index(['Name ', 'Age', 'Salary', 'Performance'], dtype='object')

In [33]:
import pandas  as pd
data = {
    "Name" : ["Aqsa" , "Erum" ,"Saba" , "Ayesha " , "Gull"],
    "Age" : [22,23,24,21,20],
    "Salary" : [50000 , 60000 , 30000 , 45000 , 55000],
    "Performance" :[85,90,92,88,89]

}
df =pd.DataFrame(data) 
# access single column
print("Names (Single column return series) \n")
name = df["Name"]
print(name)

# access multiple column
print(" \n Subset with name and salary \n")
subset = df[["Name" , "Salary"]]
print(subset)

# filter Rows
high_salary = df[df['Salary'] > 50000]
print('\n Employees with salary > 50000 \n ')
print(high_salary)

# combine multiple condition
filtered = df[(df['Age'] > 22 ) & (df['Salary'] > 50000)]
print(" \n Employee list age > 22 + salary > 50000 \n")
print(filtered)

# using or condition
filtered_or = df[(df['Age'] > 22 ) | (df['Performance'] > 90)]
print('\n Employess older than 22 OR Performance > 90 \n')
print(filtered_or)

Names (Single column return series)

0       Aqsa
1       Erum
2       Saba
3    Ayesha
4       Gull
Name: Name, dtype: object

 Subset with name and salary

      Name  Salary
0     Aqsa   50000
1     Erum   60000
2     Saba   30000
3  Ayesha    45000
4     Gull   55000

 Employees with salary > 50000

   Name  Age  Salary  Performance
1  Erum   23   60000           90
4  Gull   20   55000           89

 Employee list age > 22 + salary > 50000

   Name  Age  Salary  Performance
1  Erum   23   60000           90

 Employess older than 22 OR Performance > 90

   Name  Age  Salary  Performance
1  Erum   23   60000           90
2  Saba   24   30000           92

## **Modifying Data**

In [6]:
# Adding columns 
import pandas  as pd
data = {
    "Name" : ["Aqsa" , "Erum" ,"Saba" , "Ayesha " , "Gull"],
    "Age" : [22,23,24,21,20],
    "Salary" : [50000 , 60000 , 30000 , 45000 , 55000],
    "Performance" :[85,90,92,88,89]

}
df =pd.DataFrame(data)
print(df)
# 01 method 
df["Bonus"] = df['Salary'] * 0.1
print("\n  ")
print(df)
print("\n  ")
# 02 Method => insert =< add new column at a specific position and index in a data frame
# df.insert (loc ,"column name " , data )
df.insert(0 , "Employee Id " , [10,20,30,40,50])
print(df)

      Name  Age  Salary  Performance
0     Aqsa   22   50000           85
1     Erum   23   60000           90
2     Saba   24   30000           92
3  Ayesha    21   45000           88
4     Gull   20   55000           89


      Name  Age  Salary  Performance   Bonus
0     Aqsa   22   50000           85  5000.0
1     Erum   23   60000           90  6000.0
2     Saba   24   30000           92  3000.0
3  Ayesha    21   45000           88  4500.0
4     Gull   20   55000           89  5500.0


   Employee Id      Name  Age  Salary  Performance   Bonus
0            10     Aqsa   22   50000           85  5000.0
1            20     Erum   23   60000           90  6000.0
2            30     Saba   24   30000           92  3000.0
3            40  Ayesha    21   45000           88  4500.0
4            50     Gull   20   55000           89  5500.0

In [9]:
# updating values =>  access specific cell(row , col , set of row ) and modify it

# df.loc[row_index , "column name"]= new_value

# updating aqsa salary
df.loc[0 , "Salary"] = 80000
print(df)
print("\n")
# increasing salary by 5% (adding method)
df['Salary'] = df['Salary'] * 1.05
print(df)

   Employee Id      Name  Age   Salary  Performance   Bonus
0            10     Aqsa   22  80000.0           85  5000.0
1            20     Erum   23  63000.0           90  6000.0
2            30     Saba   24  31500.0           92  3000.0
3            40  Ayesha    21  47250.0           88  4500.0
4            50     Gull   20  57750.0           89  5500.0


   Employee Id      Name  Age   Salary  Performance   Bonus
0            10     Aqsa   22  84000.0           85  5000.0
1            20     Erum   23  66150.0           90  6000.0
2            30     Saba   24  33075.0           92  3000.0
3            40  Ayesha    21  49612.5           88  4500.0
4            50     Gull   20  60637.5           89  5500.0

In [14]:
# removing columns
# drop method => used to delete row and column in dataframe
# df.drop(columns = ["Column_name"] , inplace = True)
# single column
df.drop(columns = ["Performance"] , inplace = True)
print(df)

# multiple column
df.drop(columns = ["Employee Id " , "Age"] , inplace = True)
print(df)

      Name   Salary   Bonus
0     Aqsa  84000.0  5000.0
1     Erum  66150.0  6000.0
2     Saba  33075.0  3000.0
3  Ayesha   49612.5  4500.0
4     Gull  60637.5  5500.0

## **Handling Missing Data**

In [20]:
import pandas  as pd
data = {
    "Name" : ["Aqsa" , None ,"Saba" , "Ayesha " , "Gull"],
    "Age" : [22,None,24,21,20],
    "Salary" : [50000 , None , 30000 , 45000 , 55000],
    "Performance" :[85,None,92,88,89]

}
df =pd.DataFrame(data)
print(df)
print('\n')
# first detect missing values
print(df.isnull())
print('\n')
# return count
print(df.isnull().sum())
# remove missing value => dropna()
# df.dropna(axis=0 , inplace = True) 
# axis = 0 => drop rows with missing values , axis = 1 => drop column with missing values
df.dropna(axis = 0 , inplace = True)
print(df)

      Name   Age   Salary  Performance
0     Aqsa  22.0  50000.0         85.0
1     None   NaN      NaN          NaN
2     Saba  24.0  30000.0         92.0
3  Ayesha   21.0  45000.0         88.0
4     Gull  20.0  55000.0         89.0


    Name    Age  Salary  Performance
0  False  False   False        False
1   True   True    True         True
2  False  False   False        False
3  False  False   False        False
4  False  False   False        False


Name           1
Age            1
Salary         1
Performance    1
dtype: int64
      Name   Age   Salary  Performance
0     Aqsa  22.0  50000.0         85.0
2     Saba  24.0  30000.0         92.0
3  Ayesha   21.0  45000.0         88.0
4     Gull  20.0  55000.0         89.0

In [26]:
''' replace missing values
fillna(value , inplace = True)
'''
import pandas  as pd
data = {
    "Name" : ["Aqsa" , None ,"Saba" , "Ayesha " , "Gull"],
    "Age" : [22,None,24,21,20],
    "Salary" : [50000 , None , 30000 , 45000 , 55000],
    "Performance" :[85,None,92,88,89]

}
df =pd.DataFrame(data)
print(df)
print('\n')
 # default value
df.fillna(0 , inplace = True)
print(df)

      Name   Age   Salary  Performance
0     Aqsa  22.0  50000.0         85.0
1     None   NaN      NaN          NaN
2     Saba  24.0  30000.0         92.0
3  Ayesha   21.0  45000.0         88.0
4     Gull  20.0  55000.0         89.0


      Name   Age   Salary  Performance
0     Aqsa  22.0  50000.0         85.0
1        0   0.0      0.0          0.0
2     Saba  24.0  30000.0         92.0
3  Ayesha   21.0  45000.0         88.0
4     Gull  20.0  55000.0         89.0

In [34]:

data = {
    "Name" : ["Aqsa" , None ,"Saba" , "Ayesha " , "Gull"],
    "Age" : [22,None,24,21,20],
    "Salary" : [50000 , None , 30000 , 45000 , 55000],
    "Performance" :[85,None,92,88,89]
}

df = pd.DataFrame(data)
print(df)
print('\n')

# Filling NaN in 'Age' with mean of 'Age' column
df.fillna({'Age': df['Age'].mean()}, inplace=True)
print(df)
print('\n')
# Filling NaN in 'Salary' with mean of 'Salary' column
df.fillna({'Salary': df['Salary'].mean()}, inplace=True)
print(df)

      Name   Age   Salary  Performance
0     Aqsa  22.0  50000.0         85.0
1     None   NaN      NaN          NaN
2     Saba  24.0  30000.0         92.0
3  Ayesha   21.0  45000.0         88.0
4     Gull  20.0  55000.0         89.0


      Name    Age   Salary  Performance
0     Aqsa  22.00  50000.0         85.0
1     None  21.75      NaN          NaN
2     Saba  24.00  30000.0         92.0
3  Ayesha   21.00  45000.0         88.0
4     Gull  20.00  55000.0         89.0


      Name    Age   Salary  Performance
0     Aqsa  22.00  50000.0         85.0
1     None  21.75  45000.0          NaN
2     Saba  24.00  30000.0         92.0
3  Ayesha   21.00  45000.0         88.0
4     Gull  20.00  55000.0         89.0

In [4]:
 import pandas as pd
data = {
    "Time" : [1,2,3,4,5],
    "Value" : [12, None , 30 , None , 50]
}
df = pd.DataFrame(data)
print("Before Interpolation :")
print(df)
print("After Interpolation :")
df['Value'] = df['Value'].interpolate(method = "linear")
print(df)

Before Interpolation :
   Time  Value
0     1   12.0
1     2    NaN
2     3   30.0
3     4    NaN
4     5   50.0
After Interpolation :
   Time  Value
0     1   12.0
1     2   21.0
2     3   30.0
3     4   40.0
4     5   50.0

In [8]:
# Sorting 
# single column
import pandas  as pd
data = {
    "Name" : ["Aqsa"  ,"Saba" , "Ayesha " , "Gull" , "Erum"],
    "Age" : [22,23,24,21,20],
    "Salary" : [50000 , 60000 , 30000 , 45000 , 55000],
    "Performance" :[85,90,92,88,89]

}
df =pd.DataFrame(data)
print(df)
df.sort_values(by = "Age" , ascending = True , inplace = True)
print("Sorted Age  by Ascending :")
print(df)

      Name  Age  Salary  Performance
0     Aqsa   22   50000           85
1     Saba   23   60000           90
2  Ayesha    24   30000           92
3     Gull   21   45000           88
4     Erum   20   55000           89
Sorted by Ascending :
      Name  Age  Salary  Performance
4     Erum   20   55000           89
3     Gull   21   45000           88
0     Aqsa   22   50000           85
1     Saba   23   60000           90
2  Ayesha    24   30000           92

In [9]:
# Multiple column
data = {
    "Name" : ["Aqsa"  ,"Saba" , "Ayesha " , "Gull" , "Erum"],
    "Age" : [22,23,24,21,20],
    "Salary" : [50000 , 60000 , 30000 , 45000 , 55000],
    "Performance" :[85,90,92,88,89]

}
df =pd.DataFrame(data)
print(df)
df.sort_values(by = ["Age" , "Salary"] , ascending =[True , False], inplace = True)
print("Sorted Age  by Ascending  and salary by Descending ")
print(df)

      Name  Age  Salary  Performance
0     Aqsa   22   50000           85
1     Saba   23   60000           90
2  Ayesha    24   30000           92
3     Gull   21   45000           88
4     Erum   20   55000           89
Sorted Age  by Ascending  and salary by Descending
      Name  Age  Salary  Performance
4     Erum   20   55000           89
3     Gull   21   45000           88
0     Aqsa   22   50000           85
1     Saba   23   60000           90
2  Ayesha    24   30000           92

In [10]:
# Aggregate Function
avg_salary = df['Salary'].mean()
print(avg_salary)

48000.0

In [18]:
# Grouping
data = {
    "Name" : ["Aqsa"  ,"Saba" , "Ayesha " , "Gull" , "Erum"],
    "Age" : [22,22,24,21,24],
    "Salary" : [50000 , 60000 , 30000 , 45000 , 55000],
    "Performance" :[85,90,92,88,89]

}
df = pd.DataFrame(data)
grouped = df.groupby("Age")["Salary"].sum()
print(grouped)

Age
21     45000
22    110000
24     85000
Name: Salary, dtype: int64

In [19]:
# Multiple
grouped = df.groupby(["Age" , "Name"])["Salary"].sum()
print(grouped)

Age  Name
21   Gull       45000
22   Aqsa       50000
     Saba       60000
24   Ayesha     30000
     Erum       55000
Name: Salary, dtype: int64

In [10]:
# Merging => Combine rows from two or more dataset based on a common key(column)
import pandas as pd
df_Customer = pd.DataFrame({
    'Customer_Id' : [1,2,3,4],
    'Name' : ['Aqsa' , 'Erum' , 'Saba' , 'Anisa']
})

df_Order = pd.DataFrame({
    'Customer_Id' : [1,2,3,5],
    'Order_Amount' : [250,450,660,750]
})
df_inner = pd.merge(df_Customer ,df_Order  , on ='Customer_Id' , how = 'inner')
print('Inner Join')
print(df_inner)

df_outer = pd.merge(df_Customer ,df_Order  , on ='Customer_Id' , how = 'outer')
print('Outer Join')
print(df_outer)


df_left = pd.merge(df_Customer ,df_Order  , on ='Customer_Id' , how = 'left')
print('Left Join')
print(df_left)

df_right = pd.merge(df_Customer ,df_Order  , on ='Customer_Id' , how = 'right')
print('Right Join')
print(df_right)

df_cross = pd.merge(df_Customer ,df_Order  ,  how = 'cross')
print('Cross Join')
print(df_cross)

Inner Join
   Customer_Id  Name  Order_Amount
0            1  Aqsa           250
1            2  Erum           450
2            3  Saba           660
Outer Join
   Customer_Id   Name  Order_Amount
0            1   Aqsa         250.0
1            2   Erum         450.0
2            3   Saba         660.0
3            4  Anisa           NaN
4            5    NaN         750.0
Left Join
   Customer_Id   Name  Order_Amount
0            1   Aqsa         250.0
1            2   Erum         450.0
2            3   Saba         660.0
3            4  Anisa           NaN
Right Join
   Customer_Id  Name  Order_Amount
0            1  Aqsa           250
1            2  Erum           450
2            3  Saba           660
3            5   NaN           750
Cross Join
    Customer_Id_x   Name  Customer_Id_y  Order_Amount
0               1   Aqsa              1           250
1               1   Aqsa              2           450
2               1   Aqsa              3           660
3               1   Aqsa              5           750
4               2   Erum              1           250
5               2   Erum              2           450
6               2   Erum              3           660
7               2   Erum              5           750
8               3   Saba              1           250
9               3   Saba              2           450
10              3   Saba              3           660
11              3   Saba              5           750
12              4  Anisa              1           250
13              4  Anisa              2           450
14              4  Anisa              3           660
15              4  Anisa              5           750

In [13]:
# Concatination

df_Region1 = pd.DataFrame({
    'Customer_Id' : [1,2],
    'Name' : ['Aqsa' , 'Erum' ]
})

df_Region2 = pd.DataFrame({
    'Customer_Id' : [3,4],
    'Name' : [ 'Saba' , 'Anisa']
})
# vertically
df_vertically = pd.concat([df_Region1 , df_Region2] , axis = 0 , ignore_index = True)
print('Vertically')
print(df_vertically)

# horizontally
df_horizontally = pd.concat([df_Region1 , df_Region2] , axis = 1 , ignore_index = True)
print('horizontally')
print(df_horizontally)

Vertically
   Customer_Id   Name
0            1   Aqsa
1            2   Erum
2            3   Saba
3            4  Anisa
horizontally
   0     1  2      3
0  1  Aqsa  3   Saba
1  2  Erum  4  Anisa